# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------

tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"

# ------------------------------------------------------------------------------
# Formulae
# ------------------------------------------------------------------------------

brew "bash"
brew "bat"
brew "bat-extras"
brew "coreutils"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnupg"
brew "jenv"
brew "jq"
brew "mas"
brew "nano"
brew "navi"
brew "neofetch"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ripgrep"
brew "syncthing"
brew "tldr"
brew "tmux"
brew "urlview"

# ------------------------------------------------------------------------------
# Casks
# ------------------------------------------------------------------------------

cask "balenaetcher"
cask "bitwarden"
cask "brave-browser"
cask "caffeine"
cask "cyberduck"
cask "discord"
cask "docker"
cask "firefox"
cask "forklift"
cask "freetube"
cask "gpg-suite"
cask "intellij-idea-ce"
cask "iterm2"
cask "krita"
cask "microsoft-office"
cask "obsidian"
cask "plex"
cask "plexamp"
cask "postman"
cask "private-internet-access"
cask "pycharm-ce"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "splashtop-personal"
cask "spotify"
cask "swish"
cask "temurin"
cask "visual-studio-code"
cask "vlc"
cask "webpquicklook"

cask "font-caskaydia-cove-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-ubuntu-mono-nerd-font"


# ------------------------------------------------------------------------------
# App Store applications
# ------------------------------------------------------------------------------

mas "Prologue", id: 1459223267
mas "Tailscale", id: 1475387142

